IPSNewbie/STM32F429_OV5640_FreeRTOS/BSPDrivers/Src/camera_sd_storage.c
    *file_bytes_written = total_bytes_written;
    return CAMERA_SD_OK;
}

static void Camera_SDStorage_SetMountResult(FRESULT mount_result)
{
    s_camera_sd_status.last_mount_result = (uint32_t)mount_result;
    s_camera_sd_status.last_mount_text =
        (mount_result == FR_OK) ? "PASS" : "FAIL";
}

static void Camera_SDStorage_RecordFirstError(
    uint32_t *first_error,
    uint32_t candidate)
{
    if ((first_error != NULL) &&
        (*first_error == CAMERA_SD_OK) &&
        (candidate != CAMERA_SD_OK))
    {
        *first_error = candidate;
    }
}

static void Camera_SDStorage_EnsureDcmiDmaHandle(void)
{
    if (g_camera_dcmi.DMA_Handle == NULL)
    {
        __HAL_LINKDMA(&g_camera_dcmi, DMA_Handle, g_camera_dma);
    }
}

static uint32_t Camera_SDStorage_WaitForCardTransfer(void)
{
    uint32_t start_tick = HAL_GetTick();
    HAL_SD_CardStateTypeDef card_state;

    for (;;)
    {
        card_state = HAL_SD_GetCardState(&s_camera_sd_handle);
        if (card_state == HAL_SD_CARD_TRANSFER)
        {
            return CAMERA_SD_OK;
        }
        if ((card_state == HAL_SD_CARD_ERROR) ||
            (card_state == HAL_SD_CARD_DISCONNECTED))
        {
            return CAMERA_SD_ERR_FATFS_DISK_NOT_READY;
        }
        if ((HAL_GetTick() - start_tick) >=
            CAMERA_SD_FATFS_CARD_TIMEOUT_MS)
        {
            return CAMERA_SD_ERR_FATFS_CARD_TIMEOUT;
        }

        HAL_Delay(1U);
    }
}

static uint32_t Camera_SDStorage_GetPinMode(
    GPIO_TypeDef *port,
    uint32_t pin_number)
{
    return (port->MODER >> (pin_number * 2U)) & 0x3U;
}

static uint32_t Camera_SDStorage_GetPinPull(
    GPIO_TypeDef *port,
    uint32_t pin_number)
{
    return (port->PUPDR >> (pin_number * 2U)) & 0x3U;
}

static uint32_t Camera_SDStorage_GetPinSpeed(
    GPIO_TypeDef *port,
    uint32_t pin_number)
{
    return (port->OSPEEDR >> (pin_number * 2U)) & 0x3U;
}

static uint32_t Camera_SDStorage_GetPinAf(
    GPIO_TypeDef *port,
    uint32_t pin_number)
{
    if (pin_number < 8U)
    {
        return (port->AFR[0] >> (pin_number * 4U)) & 0xFU;
    }

    return (port->AFR[1] >> ((pin_number - 8U) * 4U)) & 0xFU;
}

static uint32_t Camera_SDStorage_VerifyFullGpioAf12(void)
{
    uint32_t index;

    for (index = 0U;
         index < (sizeof(s_camera_sd_lines) / sizeof(s_camera_sd_lines[0]));
         ++index)
    {
        const CameraSdLine_t *line = &s_camera_sd_lines[index];

        if ((Camera_SDStorage_GetPinMode(line->port, line->pin_number) != 2U) ||
            (Camera_SDStorage_GetPinPull(line->port, line->pin_number) !=
             GPIO_PULLUP) ||
            (Camera_SDStorage_GetPinSpeed(line->port, line->pin_number) !=
             GPIO_SPEED_FREQ_HIGH) ||
            (Camera_SDStorage_GetPinAf(line->port, line->pin_number) != 12U) ||
            (((line->port->OTYPER >> line->pin_number) & 0x1U) != 0U))
        {
            return 0U;
        }
    }

    return 1U;
}

static uint32_t Camera_SDStorage_ReleaseConflictPins(void)
{
    GPIO_InitTypeDef gpio = {0};

    gpio.Pin = CAMERA_SD_CONFLICT_PIN_MASK;
    gpio.Mode = GPIO_MODE_INPUT;
    gpio.Pull = GPIO_NOPULL;
    gpio.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(GPIOC, &gpio);

    if (((GPIOC->MODER & CAMERA_SD_CONFLICT_MODE_MASK) != 0U) ||
        ((GPIOC->PUPDR & CAMERA_SD_CONFLICT_MODE_MASK) != 0U))
    {
        return CAMERA_SD_ERR_CONFLICT_PIN_RELEASE_FAILED;
    }

    return CAMERA_SD_OK;
}

static uint32_t Camera_SDStorage_SwitchConflictPinsToSdioAf12(void)
{
    GPIO_InitTypeDef gpio = {0};

    gpio.Pin = CAMERA_SD_CONFLICT_PIN_MASK;
    gpio.Mode = GPIO_MODE_AF_PP;
    gpio.Pull = GPIO_PULLUP;
    gpio.Speed = GPIO_SPEED_FREQ_HIGH;
    gpio.Alternate = GPIO_AF12_SDIO;
    HAL_GPIO_Init(GPIOC, &gpio);

    if (((GPIOC->MODER & CAMERA_SD_CONFLICT_MODE_MASK) !=
         CAMERA_SD_CONFLICT_AF_MODE) ||
        ((GPIOC->PUPDR & CAMERA_SD_CONFLICT_MODE_MASK) !=
         CAMERA_SD_CONFLICT_PULLUP) ||
        ((GPIOC->OSPEEDR & CAMERA_SD_CONFLICT_MODE_MASK) !=
         CAMERA_SD_CONFLICT_SPEED_HIGH) ||
        ((GPIOC->OTYPER & CAMERA_SD_CONFLICT_PIN_MASK) != 0U) ||
        ((GPIOC->AFR[1] & CAMERA_SD_CONFLICT_AFRH_MASK) !=
         CAMERA_SD_CONFLICT_AFRH_AF12))
    {
        return CAMERA_SD_ERR_SDIO_AF12_SWITCH_FAILED;
    }

    return CAMERA_SD_OK;
}

static uint32_t Camera_SDStorage_SwitchFullSdioGpioToAf12(void)
{
    GPIO_InitTypeDef gpio = {0};

    __HAL_RCC_GPIOC_CLK_ENABLE();
    __HAL_RCC_GPIOD_CLK_ENABLE();

    gpio.Pin = CAMERA_SD_FULL_GPIOC_PIN_MASK;
    gpio.Mode = GPIO_MODE_AF_PP;
    gpio.Pull = GPIO_PULLUP;
    gpio.Speed = GPIO_SPEED_FREQ_HIGH;
    gpio.Alternate = GPIO_AF12_SDIO;
    HAL_GPIO_Init(GPIOC, &gpio);

    gpio.Pin = CAMERA_SD_FULL_GPIOD_PIN_MASK;
    HAL_GPIO_Init(GPIOD, &gpio);

    /* Mark takeover before verification so cleanup restores partial switches. */
    s_camera_sd_full_gpio_af12_selected = 1U;
    if (Camera_SDStorage_VerifyFullGpioAf12() == 0U)
    {
        return CAMERA_SD_ERR_SDIO_FULL_GPIO_SWITCH_FAILED;
    }

    return CAMERA_SD_OK;
}

static uint32_t Camera_SDStorage_LeaveFullSdioGpioToInput(void)
{
    GPIO_InitTypeDef gpio = {0};

    gpio.Pin = CAMERA_SD_FULL_GPIOC_PIN_MASK;
    gpio.Mode = GPIO_MODE_INPUT;
    gpio.Pull = GPIO_NOPULL;
    gpio.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(GPIOC, &gpio);

    gpio.Pin = CAMERA_SD_FULL_GPIOD_PIN_MASK;
    HAL_GPIO_Init(GPIOD, &gpio);

    s_camera_sd_full_gpio_af12_selected = 0U;
    if (((GPIOC->MODER & CAMERA_SD_FULL_GPIOC_MODE_MASK) != 0U) ||
        ((GPIOC->PUPDR & CAMERA_SD_FULL_GPIOC_MODE_MASK) != 0U) ||
        ((GPIOD->MODER & CAMERA_SD_FULL_GPIOD_MODE_MASK) != 0U) ||
        ((GPIOD->PUPDR & CAMERA_SD_FULL_GPIOD_MODE_MASK) != 0U))
    {
        return CAMERA_SD_ERR_SDIO_FULL_GPIO_RESTORE_FAILED;
    }

    return CAMERA_SD_OK;
}

static uint32_t Camera_SDStorage_RestoreConflictPins(void)
{
    GPIO_InitTypeDef gpio = {0};

    gpio.Pin = CAMERA_SD_CONFLICT_PIN_MASK;
    gpio.Mode = GPIO_MODE_AF_PP;
    gpio.Pull = GPIO_NOPULL;
    gpio.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    gpio.Alternate = GPIO_AF13_DCMI;
    HAL_GPIO_Init(GPIOC, &gpio);

    if (((GPIOC->MODER & CAMERA_SD_CONFLICT_MODE_MASK) !=
         CAMERA_SD_CONFLICT_AF_MODE) ||
        ((GPIOC->PUPDR & CAMERA_SD_CONFLICT_MODE_MASK) != 0U) ||
        ((GPIOC->OSPEEDR & CAMERA_SD_CONFLICT_MODE_MASK) !=
         CAMERA_SD_CONFLICT_SPEED_VERY_HIGH) ||
        ((GPIOC->OTYPER & CAMERA_SD_CONFLICT_PIN_MASK) != 0U) ||
        ((GPIOC->AFR[1] & CAMERA_SD_CONFLICT_AFRH_MASK) !=
         CAMERA_SD_CONFLICT_AFRH_AF13))
    {
        return CAMERA_SD_ERR_CONFLICT_PIN_RESTORE_FAILED;
    }

    return CAMERA_SD_OK;
}

static uint32_t Camera_SDStorage_RestoreCameraLink(
    uint32_t restore_continuous_capture,
    uint32_t verify_sdio_inputs)
{
    uint32_t result = CAMERA_SD_OK;

    (void)Camera_SnapshotControl_RequestRestore();
    Camera_SDStorage_EnsureDcmiDmaHandle();
    Camera_DCMI_Init();
    if (restore_continuous_capture != 0U)
    {
        Camera_DCMI_StartToLCD(
            0U,
            0U,
            CAMERA_SD_RESTORE_LCD_WIDTH,
            CAMERA_SD_RESTORE_LCD_HEIGHT);
    }

