IPSNewbie/STM32F429_OV5640_FreeRTOS/BSPDrivers/Src/camera_sd_storage.c
    *source_nonzero = nonzero_count;
    *source_sum32 = sum32;
    if ((nonzero_count == 0U) || (sum32 == 0U))
    {
        return CAMERA_SD_ERR_FRAME_EMPTY;
    }

    return CAMERA_SD_OK;
}

static uint32_t Camera_SDStorage_PrepareAndStageFrontFrame(
    CameraSdSnapshotResult_t *result_info)
{
    uint32_t prepare_result;
    uint32_t stage_result;
    uint32_t retry_count;

    if (result_info == NULL)
    {
        return CAMERA_SD_ERR_INVALID_ARGUMENT;
    }

    result_info->prepare_text = "FAIL";
    for (retry_count = 0U;
         retry_count <= CAMERA_SD_FRAME_PREPARE_MAX_RETRIES;
         ++retry_count)
    {
        result_info->prepare_retry = retry_count;
        result_info->source_nonzero = 0U;
        result_info->source_sum32 = 0U;
        prepare_result = Camera_RTOS_PrepareRgb565Frame(
            CAMERA_RTOS_RGB565_PREPARE_TIMEOUT_MS);
        if (prepare_result != CAMERA_RTOS_ERR_NONE)
        {
            return (prepare_result == CAMERA_RTOS_ERR_SNAPSHOT_TIMEOUT) ?
                CAMERA_SD_ERR_FRAME_PREPARE_TIMEOUT :
                CAMERA_SD_ERR_FRAME_PREPARE_FAILED;
        }

        stage_result = Camera_SDStorage_StageFrontFrame(
            &result_info->source_nonzero,
            &result_info->source_sum32);
        if (stage_result == CAMERA_SD_OK)
        {
            result_info->prepare_text = "PASS";
            return CAMERA_SD_OK;
        }
        if (stage_result != CAMERA_SD_ERR_FRAME_EMPTY)
        {
            return stage_result;
        }

        if (retry_count < CAMERA_SD_FRAME_PREPARE_MAX_RETRIES)
        {
            HAL_Delay(CAMERA_SD_FRAME_PREPARE_RETRY_DELAY_MS);
        }
    }

    return CAMERA_SD_ERR_FRAME_EMPTY;
}

uint32_t Camera_SDStorage_SaveSnapshotFrame(
    CameraSdSnapshotResult_t *snapshot_result)
{
    CameraSdSnapshotResult_t result_info;
    uint32_t result = CAMERA_SD_OK;
    uint32_t cleanup_result = CAMERA_SD_OK;
    uint32_t restore_result = CAMERA_SD_OK;
    uint32_t step_result;
    uint32_t camera_restore_required = 0U;
    uint32_t dvp_restore_required = 0U;
    uint32_t takeover_attempted = 0U;
    uint32_t mount_attempted = 0U;
    uint32_t file_opened = 0U;
    uint32_t restore_continuous_capture = 0U;
    uint32_t file_bytes_written = 0U;
    FRESULT fatfs_result;

    memset(&result_info, 0, sizeof(result_info));
    result_info.file_name = CAMERA_SD_SNAPSHOT_FILE_NAME;
    result_info.source_text = CAMERA_SD_SNAPSHOT_SOURCE_TEXT;
    result_info.source_bytes = CAMERA_FB_SIZE_BYTES;
    result_info.prepare_text = "NOT_RUN";
    result_info.format_text = CAMERA_SD_SNAPSHOT_FORMAT_TEXT;
    result_info.width = CAMERA_FB_WIDTH;
    result_info.height = CAMERA_FB_HEIGHT;
    result_info.mount_text = "NOT_RUN";
    result_info.write_text = "NOT_RUN";
    result_info.cleanup_text = "PASS";
    result_info.restore_text = "PASS";
    result_info.error_code = CAMERA_SD_OK;
    result_info.error_text = Camera_SDStorage_ErrorToString(CAMERA_SD_OK);

    s_camera_sd_status.last_snapshot_text = "RUNNING";
    s_camera_sd_status.last_file_name = CAMERA_SD_SNAPSHOT_FILE_NAME;
    s_camera_sd_status.last_file_size = 0U;
    s_camera_sd_status.last_mount_result =
        CAMERA_SD_FATFS_MOUNT_NOT_RUN;
    s_camera_sd_status.last_mount_text = "NOT_RUN";
    s_camera_sd_status.card_ready = 0U;
    s_camera_sd_status.fatfs_ready = 0U;
    s_camera_sd_fatfs_disk_error = CAMERA_SD_OK;
    Camera_SDStorage_SetSaveError(CAMERA_SD_OK);
    Camera_SDStorage_SetLastError(CAMERA_SD_OK);

    if ((Camera_SnapshotControl_IsSoftwareGuardActive() != 0U) ||
        (s_camera_sd_fatfs_session_active != 0U) ||
        (s_camera_sd_full_gpio_af12_selected != 0U) ||
        (s_camera_sd_clock_enabled != 0U) ||
        (s_camera_sd_status.dvp_mask_active != 0U))
    {
        result = CAMERA_SD_ERR_SNAPSHOT_BUSY;
        s_camera_sd_status.last_snapshot_text = "FAIL";
        Camera_SDStorage_SetSaveError(result);
        Camera_SDStorage_SetLastError(result);
        result_info.error_code = result;
        result_info.error_text = Camera_SDStorage_ErrorToString(result);
        if (snapshot_result != NULL)
        {
            *snapshot_result = result_info;
        }
        return result;
    }

    s_camera_sd_status.dvp_reg_3018_saved =
        CAMERA_SD_REG_VALUE_UNKNOWN;
    restore_continuous_capture =
        ((DCMI->CR & DCMI_CR_CAPTURE) != 0U) ? 1U : 0U;
    Camera_SDStorage_EnsureDcmiDmaHandle();
    camera_restore_required = 1U;
    step_result = Camera_SDStorage_PrepareAndStageFrontFrame(&result_info);
    if (step_result != CAMERA_SD_OK)
    {
        result = step_result;
        goto cleanup;
    }

    step_result = Camera_SnapshotControl_RequestPrepare();
    if (step_result != CAMERA_SNAPSHOT_OK)
    {
        result = CAMERA_SD_ERR_SNAPSHOT_PREPARE_FAILED;
        goto cleanup;
    }

    step_result = Camera_SDStorage_StopDvpConflictPads();
    if (s_camera_sd_status.dvp_reg_3018_saved !=
        CAMERA_SD_REG_VALUE_UNKNOWN)
    {
        dvp_restore_required = 1U;
    }
    if (step_result != CAMERA_SD_OK)
    {
        result = step_result;
        goto cleanup;
    }

    takeover_attempted = 1U;
    step_result = Camera_SDStorage_RequestTakeoverEnter();
    if (step_result != CAMERA_SD_OK)
    {
        result = step_result;
        goto cleanup;
    }

    step_result = Camera_SDStorage_RequestInit();
    if (step_result != CAMERA_SD_OK)
    {
        result = step_result;
        goto cleanup;
    }

    s_camera_sd_fatfs_session_active = 1U;
    mount_attempted = 1U;
    fatfs_result = f_mount(&s_camera_sd_fatfs, "", 1U);
    Camera_SDStorage_SetMountResult(fatfs_result);
    result_info.mount_text = s_camera_sd_status.last_mount_text;
    if (fatfs_result != FR_OK)
    {
        result = (s_camera_sd_fatfs_disk_error != CAMERA_SD_OK) ?
            s_camera_sd_fatfs_disk_error :
            CAMERA_SD_ERR_FATFS_MOUNT_FAILED;
        goto cleanup;
    }

    s_camera_sd_status.fatfs_ready = 1U;
    s_camera_sd_fatfs_write_allowed = 1U;
    fatfs_result = f_open(
        &s_camera_sd_file,
        CAMERA_SD_SNAPSHOT_FILE_NAME,
        FA_CREATE_ALWAYS | FA_WRITE);
    if (fatfs_result != FR_OK)
    {
        result = (s_camera_sd_fatfs_disk_error != CAMERA_SD_OK) ?
            s_camera_sd_fatfs_disk_error :
            CAMERA_SD_ERR_FATFS_FILE_OPEN_FAILED;
        goto cleanup;
    }
    file_opened = 1U;

    step_result = Camera_SDStorage_WriteBmp24(
        &s_camera_sd_file,
        &file_bytes_written);
    if (step_result != CAMERA_SD_OK)
    {
        result_info.write_text = "FAIL";
        result = step_result;
        goto cleanup;
    }
    result_info.write_text = "PASS";

cleanup:
    if (file_opened != 0U)
    {
        fatfs_result = f_close(&s_camera_sd_file);
        file_opened = 0U;
        if (fatfs_result != FR_OK)
        {
            result_info.write_text = "FAIL";
            step_result = (s_camera_sd_fatfs_disk_error != CAMERA_SD_OK) ?
                s_camera_sd_fatfs_disk_error :
                CAMERA_SD_ERR_FATFS_FILE_CLOSE_FAILED;
            Camera_SDStorage_RecordFirstError(&cleanup_result, step_result);
            Camera_SDStorage_RecordFirstError(&result, step_result);
        }
    }
    s_camera_sd_fatfs_write_allowed = 0U;

